xively/xively-client-c/examples/cc3200/xively_demo/main.c
            if ( XI_INVALID_TIMED_TASK_HANDLE == gTemperatureTaskHandle )
            {
                UART_PRINT( "send_temperature_task couldn't be registered\r\n" );
            }

            /* subscribe to LED topics to listen for light toggle commands */
            xi_subscribe( in_context_handle, gGreenLedTopicName, XI_MQTT_QOS_AT_MOST_ONCE,
                          onLedTopic, ( void* )&gGreenLed );
            xi_subscribe( in_context_handle, gOrangeLedTopicName,
                          XI_MQTT_QOS_AT_MOST_ONCE, onLedTopic, ( void* )&gOrangeLed );
            xi_subscribe( in_context_handle, gRedLedTopicName, XI_MQTT_QOS_AT_MOST_ONCE,
                          onLedTopic, ( void* )&gRedLed );

            /* enable the button interrupts */
            Button_IF_EnableInterrupt( SW2 | SW3 );

            break;
        case XI_CONNECTION_STATE_CLOSED:
            UART_PRINT( "connection closed - reason %d!\n", state );

            /* cancel timed task - we don't want to send messages while the library not
             * connected */
            xi_cancel_timed_task( gTemperatureTaskHandle );
            gTemperatureTaskHandle = XI_INVALID_TIMED_TASK_HANDLE;

            /* disable button interrupts so the messages for button push/release events
             * won't be sent */
            Button_IF_DisableInterrupt( SW2 | SW3 );

            /* check if the close was due to the user's request */
            if ( XI_STATE_OK == state )
            {
                xi_events_stop();
            }
            else
            {
                WaitForWlanEvent();

                xi_connect( in_context_handle, conn_data->username, conn_data->password,
                            conn_data->connection_timeout, conn_data->keepalive_timeout,
                            conn_data->session_type, &on_connected );
            }
            return;
        default:
            UART_PRINT( "invalid parameter %d\n", conn_data->connection_state );
            return;
    }
}

/**
 * @brief Driver for the xively library logic
 *
 * This function initialises the library, creates a context and starts the internal event
 * dispatcher and event processing of xively library.
 *
 * This function is blocking for the sakness of this demo application however it is
 * possible to run xively's event processing with limit of iterations.
 */
void ConnectToXively()
{
    /* Register Push Button Handlers */
    Button_IF_Init( pushButtonInterruptHandlerSW2, pushButtonInterruptHandlerSW3 );

    /* Make the buttons to react on both press and release events */
    MAP_GPIOIntTypeSet( GPIOA1_BASE, GPIO_PIN_5, GPIO_BOTH_EDGES );
    MAP_GPIOIntTypeSet( GPIOA2_BASE, GPIO_PIN_6, GPIO_BOTH_EDGES );

    /* Disable the interrupt for now */
    Button_IF_DisableInterrupt( SW2 | SW3 );

    xi_state_t ret_state = xi_initialize( "account_id", "xi_username", 0 );

    if ( XI_STATE_OK != ret_state )
    {
        UART_PRINT( "xi failed to initialise\r\n" );
        return;
    }

    gXivelyContextHandle = xi_create_context();

    if ( XI_INVALID_CONTEXT_HANDLE == gXivelyContextHandle )
    {
        UART_PRINT( " xi failed to create context, error: %d\n", -gXivelyContextHandle );
        return;
    }

    xi_state_t connect_result =
        xi_connect( gXivelyContextHandle, XIVELY_DEVICE_ID, XIVELY_DEVICE_PASSWORD, 10, 0,
                    XI_SESSION_CLEAN, &on_connected );

    /* start processing xively library events */
    xi_events_process_blocking();

    /* when the event dispatcher is stop destroy the context */
    xi_delete_context( gXivelyContextHandle );

    /* shutdown the xively library */
    xi_shutdown();
}

/**
 * @brief Function that is required by TLS library to track the current time.
 */
time_t XTIME( time_t* timer )
{
    return xi_bsp_time_getcurrenttime_seconds();
}

/**
 * @brief Function required by the TLS library.
 */
uint32_t xively_ssl_rand_generate()
{
    return xi_bsp_rng_get();
}

/******************************************************************************/
/* END OF XIVELY CODE */
/******************************************************************************/

//*****************************************************************************
// These functions are from the ent_wlan example of the CC3200 SDK. They exist in this
// project to facilitate state tracking of the WiFi connection for the device and are not
// Xively specific.
//
// If you would like more information and documentation on these functions, please see the
// source code in the directory example/ent_wlan of your CC3200 SDK installation.
//*****************************************************************************

void SimpleLinkWlanEventHandler( SlWlanEvent_t* pWlanEvent )
{
    if ( !pWlanEvent )
    {
        return;
    }

    switch ( pWlanEvent->Event )
    {
        case SL_WLAN_CONNECT_EVENT:
        {
            SET_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );

            // Copy new connection SSID and BSSID to global parameters
            memcpy( g_ucConnectionSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_name,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_len );
            memcpy( g_ucConnectionBSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.bssid,
                    SL_BSSID_LENGTH );

            UART_PRINT( "[WLAN EVENT] STA Connected to the AP: %s , "
                        "BSSID: %x:%x:%x:%x:%x:%x\n\r",
                        g_ucConnectionSSID, g_ucConnectionBSSID[0],
                        g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                        g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                        g_ucConnectionBSSID[5] );
        }
        break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            slWlanConnectAsyncResponse_t* pEventData = NULL;

