xively/xively-client-c/examples/cc3200/xively_demo/main.c
            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );
            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_IP_AQUIRED );

            pEventData = &pWlanEvent->EventData.STAandP2PModeDisconnected;

            // If the user has initiated 'Disconnect' request,
            //'reason_code' is SL_WLAN_DISCONNECT_USER_INITIATED_DISCONNECTION
            if ( SL_USER_INITIATED_DISCONNECTION == pEventData->reason_code )
            {
                UART_PRINT( "[WLAN EVENT]Device disconnected from the AP: %s, "
                            "BSSID: %x:%x:%x:%x:%x:%x on application's request \n\r",
                            g_ucConnectionSSID, g_ucConnectionBSSID[0],
                            g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                            g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                            g_ucConnectionBSSID[5] );
            }
            else
            {
                UART_PRINT( "[WLAN ERROR]Device disconnected from the AP AP: %s,"
                            "BSSID: %x:%x:%x:%x:%x:%x on an ERROR..!! \n\r",
                            g_ucConnectionSSID, g_ucConnectionBSSID[0],
                            g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                            g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                            g_ucConnectionBSSID[5] );
            }
            memset( g_ucConnectionSSID, 0, sizeof( g_ucConnectionSSID ) );
            memset( g_ucConnectionBSSID, 0, sizeof( g_ucConnectionBSSID ) );
        }
        break;

        default:
        {
            UART_PRINT( "[WLAN EVENT] Unexpected event [0x%x]\n\r", pWlanEvent->Event );
        }
        break;
    }
}

void SimpleLinkNetAppEventHandler( SlNetAppEvent_t* pNetAppEvent )
{
    if ( !pNetAppEvent )
    {
        return;
    }

    switch ( pNetAppEvent->Event )
    {
        case SL_NETAPP_IPV4_IPACQUIRED_EVENT:
        {
            SlIpV4AcquiredAsync_t* pEventData = NULL;

            SET_STATUS_BIT( g_ulStatus, STATUS_BIT_IP_AQUIRED );

            // Ip Acquired Event Data
            pEventData = &pNetAppEvent->EventData.ipAcquiredV4;

            // Gateway IP address
            g_ulGatewayIP = pEventData->gateway;

            UART_PRINT( "[NETAPP EVENT] IP Acquired: IP=%d.%d.%d.%d ,"
                        "Gateway=%d.%d.%d.%d\n\r",
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 3 ),
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 2 ),
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 1 ),
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.ip, 0 ),
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 3 ),
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 2 ),
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 1 ),
                        SL_IPV4_BYTE( pNetAppEvent->EventData.ipAcquiredV4.gateway, 0 ) );
        }
        break;

        default:
        {
            UART_PRINT( "[NETAPP EVENT] Unexpected event [0x%x] \n\r",
                        pNetAppEvent->Event );
        }
        break;
    }
}

void SimpleLinkHttpServerCallback( SlHttpServerEvent_t* pHttpEvent,
                                   SlHttpServerResponse_t* pHttpResponse )
{
    // Unused in this application
}

void SimpleLinkGeneralEventHandler( SlDeviceEvent_t* pDevEvent )
{
    UART_PRINT( "[GENERAL EVENT] - ID=[%d] Sender=[%d]\n\n",
                pDevEvent->EventData.deviceEvent.status,
                pDevEvent->EventData.deviceEvent.sender );
}

void SimpleLinkSockEventHandler( SlSockEvent_t* pSock )
{
    if ( !pSock )
    {
        return;
    }

    //
    // This application doesn't work w/ socket - Events are not expected
    //
    switch ( pSock->Event )
    {
        case SL_SOCKET_TX_FAILED_EVENT:
            switch ( pSock->socketAsyncEvent.SockTxFailData.status )
            {
                case SL_ECLOSE:
                    UART_PRINT( "[SOCK ERROR] - close socket (%d) operation "
                                "failed to transmit all queued packets\n\n",
                                pSock->socketAsyncEvent.SockTxFailData.sd );
                    break;
                default:
                    UART_PRINT( "[SOCK ERROR] - TX FAILED  :  socket %d , reason "
                                "(%d) \n\n",
                                pSock->socketAsyncEvent.SockTxFailData.sd,
                                pSock->socketAsyncEvent.SockTxFailData.status );
                    break;
            }
            break;

        default:
            UART_PRINT( "[SOCK EVENT] - Unexpected Event [%x0x]\n\n", pSock->Event );
            break;
    }
}

_SlEventPropogationStatus_e
sl_Provisioning_HttpServerEventHdl( SlHttpServerEvent_t* apSlHttpServerEvent,
                                    SlHttpServerResponse_t* apSlHttpServerResponse )
{
    // Unused in this application
    return EVENT_PROPAGATION_CONTINUE;
}

_SlEventPropogationStatus_e
sl_Provisioning_NetAppEventHdl( SlNetAppEvent_t* apNetAppEvent )
{
    // Unused in this application
    return EVENT_PROPAGATION_CONTINUE;
}

_SlEventPropogationStatus_e sl_Provisioning_WlanEventHdl( SlWlanEvent_t* apEventInfo )
{
    // Unused in this application
    return EVENT_PROPAGATION_CONTINUE;
}

static void InitializeAppVariables()
{
    g_ulStatus    = 0;
    g_ulGatewayIP = 0;
    memset( g_ucConnectionSSID, 0, sizeof( g_ucConnectionSSID ) );
    memset( g_ucConnectionBSSID, 0, sizeof( g_ucConnectionBSSID ) );
}

static long ConfigureSimpleLinkToDefaultState()
{
    SlVersionFull ver                                  = {0};
    _WlanRxFilterOperationCommandBuff_t RxFilterIdMask = {0};

    unsigned char ucVal       = 1;
    unsigned char ucConfigOpt = 0;
    unsigned char ucConfigLen = 0;
    unsigned char ucPower     = 0;

    long lRetVal = -1;
    long lMode   = -1;

    lMode = sl_Start( 0, 0, 0 );
    ASSERT_ON_ERROR( lMode );

    // If the device is not in station-mode, try configuring it in station-mode
    if ( ROLE_STA != lMode )
    {
        if ( ROLE_AP == lMode )
        {
            // If the device is in AP mode, we need to wait for this event
            // before doing anything
            while ( !IS_IP_ACQUIRED( g_ulStatus ) )
            {
#ifndef SL_PLATFORM_MULTI_THREADED
                _SlNonOsMainLoopTask();
#endif
            }
        }

        // Switch to STA role and restart
        lRetVal = sl_WlanSetMode( ROLE_STA );
        ASSERT_ON_ERROR( lRetVal );

        lRetVal = sl_Stop( 0xFF );
        ASSERT_ON_ERROR( lRetVal );

        lRetVal = sl_Start( 0, 0, 0 );
        ASSERT_ON_ERROR( lRetVal );

        // Check if the device is in station again
        if ( ROLE_STA != lRetVal )
        {
            // We don't want to proceed if the device is not coming up in STA-mode
            return DEVICE_NOT_IN_STATION_MODE;
        }
    }

    // Get the device's version-information
    ucConfigOpt = SL_DEVICE_GENERAL_VERSION;
    ucConfigLen = sizeof( ver );
    lRetVal     = sl_DevGet( SL_DEVICE_GENERAL_CONFIGURATION, &ucConfigOpt, &ucConfigLen,
                         ( unsigned char* )( &ver ) );
    ASSERT_ON_ERROR( lRetVal );

    UART_PRINT( "Host Driver Version: %s\n\r", SL_DRIVER_VERSION );
    UART_PRINT(
        "Build Version %d.%d.%d.%d.31.%d.%d.%d.%d.%d.%d.%d.%d\n\r", ver.NwpVersion[0],
        ver.NwpVersion[1], ver.NwpVersion[2], ver.NwpVersion[3],
        ver.ChipFwAndPhyVersion.FwVersion[0], ver.ChipFwAndPhyVersion.FwVersion[1],
        ver.ChipFwAndPhyVersion.FwVersion[2], ver.ChipFwAndPhyVersion.FwVersion[3],
        ver.ChipFwAndPhyVersion.PhyVersion[0], ver.ChipFwAndPhyVersion.PhyVersion[1],
        ver.ChipFwAndPhyVersion.PhyVersion[2], ver.ChipFwAndPhyVersion.PhyVersion[3] );

    // Set connection policy to Auto + SmartConfig
    //      (Device's default connection policy)
    lRetVal = sl_WlanPolicySet( SL_POLICY_CONNECTION,
                                SL_CONNECTION_POLICY( 1, 0, 0, 0, 1 ), NULL, 0 );
    ASSERT_ON_ERROR( lRetVal );

