xively/xively-client-c/examples/cc3200/xively_demo/main.c
    // Remove all profiles
    lRetVal = sl_WlanProfileDel( 0xFF );
    ASSERT_ON_ERROR( lRetVal );

    lRetVal = sl_WlanDisconnect();
    if ( 0 == lRetVal )
    {
        // Wait
        while ( IS_CONNECTED( g_ulStatus ) )
        {
#ifndef SL_PLATFORM_MULTI_THREADED
            _SlNonOsMainLoopTask();
#endif
        }
    }

    // Enable DHCP client
    lRetVal = sl_NetCfgSet( SL_IPV4_STA_P2P_CL_DHCP_ENABLE, 1, 1, &ucVal );
    ASSERT_ON_ERROR( lRetVal );

    // Disable scan
    ucConfigOpt = SL_SCAN_POLICY( 0 );
    lRetVal     = sl_WlanPolicySet( SL_POLICY_SCAN, ucConfigOpt, NULL, 0 );
    ASSERT_ON_ERROR( lRetVal );

    // Set Tx power level for station mode
    // Number between 0-15, as dB offset from max power - 0 will set max power
    ucPower = 0;
    lRetVal =
        sl_WlanSet( SL_WLAN_CFG_GENERAL_PARAM_ID, WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1,
                    ( unsigned char* )&ucPower );
    ASSERT_ON_ERROR( lRetVal );

    // Set PM policy to normal
    lRetVal = sl_WlanPolicySet( SL_POLICY_PM, SL_NORMAL_POLICY, NULL, 0 );
    ASSERT_ON_ERROR( lRetVal );

    // Unregister mDNS services
    lRetVal = sl_NetAppMDNSUnRegisterService( 0, 0 );
    ASSERT_ON_ERROR( lRetVal );

    // Remove  all 64 filters (8*8)
    memset( RxFilterIdMask.FilterIdMask, 0xFF, 8 );
    lRetVal = sl_WlanRxFilterSet( SL_REMOVE_RX_FILTER, ( _u8* )&RxFilterIdMask,
                                  sizeof( _WlanRxFilterOperationCommandBuff_t ) );
    ASSERT_ON_ERROR( lRetVal );

    lRetVal = sl_Stop( SL_STOP_TIMEOUT );
    ASSERT_ON_ERROR( lRetVal );

    InitializeAppVariables();

    return lRetVal; // Success
}

static void BoardInit( void )
{
/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
//
// Set vector table base
//
#if defined( ccs )
    MAP_IntVTableBaseSet( ( unsigned long )&g_pfnVectors[0] );
#endif
#if defined( ewarm )
    MAP_IntVTableBaseSet( ( unsigned long )&__vector_table );
#endif
#endif
    //
    // Enable Processor
    //
    MAP_IntMasterEnable();
    MAP_IntEnable( FAULT_SYSTICK );

    PRCMCC3200MCUInit();
}

void WaitForWlanEvent()
{
    // Wait for WLAN Event
    while ( ( !IS_CONNECTED( g_ulStatus ) ) || ( !IS_IP_ACQUIRED( g_ulStatus ) ) )
    {
        // Toggle LEDs to Indicate Connection Progress
        _SlNonOsMainLoopTask();
        MAP_UtilsDelay( 2000000 );
        GPIO_IF_LedOn( MCU_ALL_LED_IND );
        _SlNonOsMainLoopTask();
        MAP_UtilsDelay( 2000000 );
        GPIO_IF_LedOff( MCU_ALL_LED_IND );
    }
}

long MainLogic()
{
    SlSecParams_t g_SecParams;
    long lRetVal          = -1;
    unsigned char pValues = 0;

    InitializeAppVariables();

    lRetVal = ConfigureSimpleLinkToDefaultState();
    if ( lRetVal < 0 )
    {
        if ( DEVICE_NOT_IN_STATION_MODE == lRetVal )
            UART_PRINT( "Failed to configure the device "
                        "in its default state \n\r" );

        return lRetVal;
    }

    UART_PRINT( "Device is configured in default state \n\r" );

    CLR_STATUS_BIT_ALL( g_ulStatus );

    // Start simplelink
    lRetVal = sl_Start( 0, 0, 0 );
    if ( lRetVal < 0 || ROLE_STA != lRetVal )
    {
        UART_PRINT( "Failed to start the device \n\r" );
        return lRetVal;
    }

    UART_PRINT( "Device started as STATION \n\r" );

    // start ent wlan connection
    g_SecParams.Key    = PASSWORD;
    g_SecParams.KeyLen = strlen( ( const char* )g_SecParams.Key );
    g_SecParams.Type   = SL_SEC_TYPE_WPA_WPA2;

    // 0 - Disable the server authnetication | 1 - Enable (this is the deafult)
    pValues = 0;
    sl_WlanSet( SL_WLAN_CFG_GENERAL_PARAM_ID, 19, 1, &pValues );

    // add the wlan profile
    sl_WlanProfileAdd( ENT_NAME, strlen( ENT_NAME ), 0, &g_SecParams, 0, 1, 0 );

    // set the connection policy to auto
    pValues = 0;
    sl_WlanPolicySet( SL_POLICY_CONNECTION, SL_CONNECTION_POLICY( 1, 1, 0, 0, 0 ),
                      &pValues, 1 );

    // wait for the WiFi connection
    WaitForWlanEvent();

    // this is where the connection to Xively Broker can be established
    ConnectToXively();

    // wait for few moments
    MAP_UtilsDelay( 80000000 );

    // Disconnect from network
    lRetVal = sl_WlanDisconnect();

    //
    // power off the network processor
    //
    lRetVal = sl_Stop( SL_STOP_TIMEOUT );

    return SUCCESS;
}

int main()
{
    long lRetVal = -1;

    //
    // Initialize Board configurations
    //
    BoardInit();

    PinMuxConfig();

    // configure RED and Green LED
    GPIO_IF_LedConfigure( LED1 | LED2 | LED3 );

#ifndef NOTERM
    InitTerm();
    ClearTerm();
#endif

    lRetVal = MainLogic();

    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
    }

    LOOP_FOREVER();
}
